In [94]:
import pandas as pd
from IPython.display import display

In [95]:
employees = {
    'Nome': ['Ana', 'Bruno', 'Carlos', 'Daniela', 'Eduardo', 'Fernanda', 'Gabriel', 'Heloísa'],
    'Idade': [25, 30, 28, 35, 40, 29, 32, 26],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Curitiba', 
               'São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Curitiba'],
    'Salário': [3500, 4200, 3900, 4500, 5000, 3800, 4100, 3600],
    'Departamento': ['TI', 'Vendas', 'TI', 'RH', 'Financeiro', 'Vendas', 'TI', 'RH']
}
df = pd.DataFrame(employees)
display(df)

       Nome  Idade          Cidade  Salário Departamento
0       Ana     25       São Paulo     3500           TI
1     Bruno     30  Rio de Janeiro     4200       Vendas
2    Carlos     28  Belo Horizonte     3900           TI
3   Daniela     35        Curitiba     4500           RH
4   Eduardo     40       São Paulo     5000   Financeiro
5  Fernanda     29  Rio de Janeiro     3800       Vendas
6   Gabriel     32  Belo Horizonte     4100           TI
7   Heloísa     26        Curitiba     3600           RH

In [96]:
# media_salarial = df.groupby('')
display(f'The mean salaryal of employees is: {df['Salário'].mean()}')

'The mean salaryal of employees is: 4075.0'

In [97]:
min = df.groupby('Nome', as_index=False)['Salário'].sum().sort_values('Salário')
min_name = min.iloc[0]['Nome']
min_line = df[df['Nome'] == min_name]
display(f'The minimum salary is:')
display(min_line)

'The minimum salary is:'

  Nome  Idade     Cidade  Salário Departamento
0  Ana     25  São Paulo     3500           TI

In [98]:
display('The Max Salary')
max = df.groupby('Nome', as_index=False)['Salário'].max().sort_values('Salário', ascending=False)
name_max = max.iloc[0]['Nome']
line2= df[df['Nome'] == name_max]
display(max)
display(name_max)
display(line2)

'The Max Salary'

       Nome  Salário
4   Eduardo     5000
3   Daniela     4500
1     Bruno     4200
6   Gabriel     4100
2    Carlos     3900
5  Fernanda     3800
7   Heloísa     3600
0       Ana     3500

'Eduardo'

      Nome  Idade     Cidade  Salário Departamento
4  Eduardo     40  São Paulo     5000   Financeiro

In [99]:
medium = df['Salário'].median()
display(medium)

np.float64(4000.0)

In [103]:
media_department = df.groupby('Departamento')['Salário'].mean()
display(media_department)

Departamento
Financeiro    5000.000000
RH            4050.000000
TI            3833.333333
Vendas        4000.000000
Name: Salário, dtype: float64

In [115]:
employ_city = df.groupby('Cidade')['Cidade'].count()
display(employ_city)
higher_medium = df.groupby('Cidade')['Salário'].mean().sort_values(ascending=False).index[0]

display(higher_medium)

Cidade
Belo Horizonte    2
Curitiba          2
Rio de Janeiro    2
São Paulo         2
Name: Cidade, dtype: int64

'São Paulo'

In [126]:
import numpy as np
df['Faixa_Etária'] = 'Desconhecida'
condicoes = [
    (df['Idade'] <= 29), 
    (df['Idade'] >= 30) & (df['Idade'] <= 59),  
    (df['Idade'] >= 60) 
]
valores = ['Jovem', 'Adulto', 'Idoso']
df['Faixa_Etária'] = np.select(condicoes, valores, default='Desconhecida')

display(df)

       Nome  Idade          Cidade  Salário Departamento Faixa_Etária
0       Ana     25       São Paulo     3500           TI        Jovem
1     Bruno     30  Rio de Janeiro     4200       Vendas       Adulto
2    Carlos     28  Belo Horizonte     3900           TI        Jovem
3   Daniela     35        Curitiba     4500           RH       Adulto
4   Eduardo     40       São Paulo     5000   Financeiro       Adulto
5  Fernanda     29  Rio de Janeiro     3800       Vendas        Jovem
6   Gabriel     32  Belo Horizonte     4100           TI       Adulto
7   Heloísa     26        Curitiba     3600           RH        Jovem